In [50]:
import pandas as pd
df=pd.read_csv('titanic.csv')

In [51]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [52]:
# Data exploration
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [53]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [54]:
targets=df.Survived
inputs=df.drop('Survived',axis='columns')

In [71]:
targets

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [55]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [56]:
dummies=pd.get_dummies(inputs.Sex)

In [57]:
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [58]:
inputs=pd.concat([inputs,dummies],axis='columns')

In [59]:
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [60]:
inputs.drop('Sex',axis='columns',inplace=True)

In [61]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [62]:
# ckeck is there any NaN in the columns 
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [66]:
inputs.Age.head(10)
# inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [67]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())

In [70]:
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [104]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,targets,test_size=0.2)

In [98]:
len(x_train)

712

In [99]:
len(inputs)

891

In [100]:
len(x_test)

179

In [101]:
x_train

     Pclass        Age      Fare  female  male
470       3  29.699118    7.2500       0     1
276       3  45.000000    7.7500       1     0
733       2  23.000000   13.0000       0     1
273       1  37.000000   29.7000       0     1
469       3   0.750000   19.2583       1     0
..      ...        ...       ...     ...   ...
581       1  39.000000  110.8833       1     0
212       3  22.000000    7.2500       0     1
640       3  20.000000    7.8542       0     1
294       3  24.000000    7.8958       0     1
493       1  71.000000   49.5042       0     1

[712 rows x 5 columns]

In [105]:
# apply the gaussian naive bayes
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()
model.fit(x_train,y_train)

GaussianNB()

In [106]:
model.score(x_test,y_test)

0.8100558659217877

In [107]:
x_test[:10]

     Pclass        Age     Fare  female  male
847       3  35.000000   7.8958       0     1
261       3   3.000000  31.3875       0     1
772       2  57.000000  10.5000       1     0
330       3  29.699118  23.2500       1     0
236       2  44.000000  26.0000       0     1
654       3  18.000000   6.7500       1     0
372       3  19.000000   8.0500       0     1
618       2   4.000000  39.0000       1     0
366       1  60.000000  75.2500       1     0
349       3  42.000000   8.6625       0     1

In [108]:
model.predict(x_test[:10])

array([0, 0, 1, 1, 0, 1, 0, 1, 1, 0])

In [109]:
model.predict_proba(x_test[:10])

array([[0.98878351, 0.01121649],
       [0.97427215, 0.02572785],
       [0.03680538, 0.96319462],
       [0.09663994, 0.90336006],
       [0.97247593, 0.02752407],
       [0.08210151, 0.91789849],
       [0.98625836, 0.01374164],
       [0.01910346, 0.98089654],
       [0.00223842, 0.99776158],
       [0.98866823, 0.01133177]])